{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.3.1", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "filters": 32, "name": "conv2d_1", "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [5, 5], "padding": "valid", "batch_input_shape": [null, 150, 150, 3]}}, {"class_name": "Activation", "config": {"trainable": true, "dtype": "float32", "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "filters": 64, "name": "conv2d_2", "activation": "linear", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "padding": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "dtype": "float32", "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "filters": 128, "name": "conv2d_3", "activation": "linear", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "padding": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "dtype": "float32", "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "dtype": "float32", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 128, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "dtype": "float32", "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.5, "seed": null, "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 1, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "dtype": "float32", "name": "activation_5", "activation": "sigmoid"}}]}}