{"keras_version": "2.3.1", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "kernel_size": [5, 5], "bias_regularizer": null, "filters": 32, "padding": "valid", "dtype": "float32", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "batch_input_shape": [null, 150, 150, 3], "name": "conv2d_1", "bias_constraint": null, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu", "dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "dtype": "float32", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 64, "padding": "valid", "dtype": "float32", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu", "dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "dtype": "float32", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 128, "padding": "valid", "dtype": "float32", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu", "dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "dtype": "float32", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "dtype": "float32", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_1", "units": 128, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu", "dtype": "float32"}}, {"class_name": "Dropout", "config": {"seed": null, "dtype": "float32", "noise_shape": null, "name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_2", "units": 1, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "sigmoid", "dtype": "float32"}}]}, "class_name": "Sequential"}